#Dados liga de alumínio-lítio / viscosidade para trÊs misturas

#diagrama de ramos e folhas.

liga<-c(105,97,245,163,207,134,218,199,160,196,
221,154,228,131,180,178,157,151,175,201,
183,153,174,154,190,76,101,142,149,200,
186,174,199,115,193,167,171,163,87,176,
121,120,181,160,194,184,165,145,160,150,
181,168,158,208,133,135,172,171,237,170,
180,167,176,158,156,229,158,148,150,118,
143,141,110,133,123,146,169,158,135,149)
stem(liga,scale=2)
stem(liga,scale = 1, width=34)
#scale=indica quantas casa decimais considerar


#histograma 
hist(liga, main = "", xlab = "Resistência à compressão", ylab = "frequências absolutas")

hist(liga, main = "", xlab = "Resistência à compressão", ylab = "frequências absolutas", nclass=17)

curve(dnorm(liga,mean=mean(liga),sd=sd(liga)),col=2,lty=2,lwd=2,add=TRUE)

boxplot(liga)

median(liga)
summary(liga)
quantile(liga, seq(0.10,0.90, 0.10))
quantile(liga, seq(0.01,0.99, 0.01))
x11()

#Medidas de viscosidade para três misturas

v1<-c(22.02,23.83,26.67,25.38,25.49,23.50,25.90,25.98)
v2<-c(21.49,22.67,24.62,24.18,22.78,22.56,24.26,23.79)
v3<-c(20.33,21.67,24.67,22.45,22.28,21.95,20.49,21.81)
boxplot(v1,v2,v3)

tempo<-c(5.1,5.3,5.3,5.6,5.8,5.9,6,6.1,6.2,6.2,6.3,6.3,6.3,6.4,6.4,6.4,6.5,6.5,6.6,
6.7,6.7,6.7,6.8,6.8,6.9,6.9,7,7.1,7.1,7.2,7.2,7.3,7.4,7.5,7.5,7.6,7.6,7.7,7.7,7.8,
7.8,7.9,7.9,8,8,8.1,8.2,8.3,8.3,8.4,8.5,8.5,8.6,8.7,8.8,8.8,8.9,9,9.1,9.2,9.4,9.4,
9.5,9.5,9.6,9.8,9.9,10.0,10.2,10.2,10.4,10.6,10.8,10.9,11.2,11.8,12.3,12.7,14.9)
hist(tempo)

d1<-c(50.5,51.1,52.4,53.0,53.4,53.5,54.1,55.3,55.7,55.7,
59.5,63.5,64.3,67.3,69.1,69.5,70.2,70.5,  71.4,  72.3,
73.0,74.4,77.8,78.5,82.5,82.7,84.3,85.8,87.5,95.4,119.0)
boxplot(d1)